pillar/pillar/0/New folder/oldU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bc_inlet
    {
        type            fixedValue;
        value           uniform (0.01 0 0);
    }

    bc_outlet
    {
        type            zeroGradient;
    }

    wall_pillar
    {
        type            noSlip;
    }
    
    wall_top
    {
        type            noSlip;
    }

    wall_bottom
    {
        type            noSlip;
    }
    
    per_1
    {
        type            noSlip;
    }

    per_2
    {
        type            noSlip;
    }
}


// ************************************************************************* //
