pillar/pillar/0/New folder/oldp
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bc_inlet
    {
        type            zeroGradient;
    }

    bc_outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    wall_pillar
    {
        type            zeroGradient;
    }
    
    wall_top
    {
        type            zeroGradient;
    }

    wall_bottom
    {
        type            zeroGradient;
    }
    
    per_1
    {
        type            zeroGradient;
    }

    per_2
    {
        type            zeroGradient;
    }   
    
    
    
}


// ************************************************************************* //
