pillar/pillar/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

boundaryField
{
    bc_inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    "(wall_pillar|wall_top|wall_bottom)"
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    "(per_1|per_2)"
    {
        type            zeroGradient;
    }

    ".*"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
