pillar/pillar/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    bc_inlet
    {
        type            patch;
        nFaces          678;
        startFace       432732;
    }
    per_1
    {
        type            empty;
        nFaces          2038;
        startFace       433410;
    }
    per_2
    {
        type            empty;
        nFaces          2038;
        startFace       435448;
    }
    wall_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3293;
        startFace       437486;
    }
    wall_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3313;
        startFace       440779;
    }
    bc_outlet
    {
        type            patch;
        nFaces          678;
        startFace       444092;
    }
    wall_pillar
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2982;
        startFace       444770;
    }
)

// ************************************************************************* //
